// Task 24. Напишите программу, которая принимает на вход число (А) и выдает сумму чисел от 1 до А.
// 7 -> 28
// 4 -> 10
// 8 -> 36
/*
int ReadNumber(string message)
{
    Console.Write(message);
    return int.Parse(Console.ReadLine()!);
}
int SumFrom1toA(int a)
{
    int sum = 0;
    for(int i = 1; i <= a; i++)
    {
        sum += i; // sum = sum + i
    }
    return sum;
}

int number = ReadNumber("Enter number: ");
int result = SumFrom1toA(number);
Console.WriteLine($"Сумма чисел от 1 до {number} = {result}");
*/
